[{"PRON":”NZXT PHANTOM 410","GRAPH":"NZXTP410.jpeg","COST":"200.00","MRSP":"119.99","QOH":"50","QOB":"0","ITEM":" The Phantom 410 features innovative right-mounted HDD rails, a solution for easy hard drive replacement. This mid-tower comes equipped with a dual radiator water cooling solution with a clearance of 30mm, an interior pivot 120mm/140mm fan slot, the capability of installing up to eight fans, and a single 30W fan control. The Phantom comes with two internal USB 3.0 headers that directly connect to the motherboard. Be the envy of all PC gamers - the Phantom 410 is bringing sexy back.”,"BRAND":"NZXT"},{"PRON":"NZXT CRAFTED 921RB","GRAPH":"NZXTC921RB","COST":"80.00","MRSP":"79.99","QOH":"5","QOB":"2","ITEM":" NZXT celebrates the rebirth of the Guardian 921 with the renewed Guardian 921 RB. Expanded upon its predecessor, Guardian 921 RB reflects the gamer design, structural integrity, and temperature monitoring system of the original while displaying a wide range of new features to complete the system builder's dream budget case. New features include a bottom-oriented power supply mount, CPU heatsink cutout, and an extra 140mm fan slot. Game beyond your limits with the Guardian 921 RB.","BRAND":"NZXT"},{"PRON":"NZXT Manta","GRAPH":"NZXTM","COST":"185","MRSP":"184.99","QOH":"3","QOB":"0","ITEM":" An expansive interior combined with easy to remove filters and side panels make for an effortless build experience. With the absence of typical obstructions such as 5.25" bays and HDD cages, installing components and routing cables in the Manta is seamless. ","BRAND":"NZXT"},{"PRON":"NZXT Noctis 450","GRAPH":"NZXTN450","COST":"180","MRSP":"179.99","QOH":"4","QOB":"5","ITEM":"The Noctis shares the interior layout of the tried and true H440 - featuring effortless cable management, fully modular hard drive trays, integrated PSU shroud -- and adds on many features to make it a bold choice for any battle-hardened gamer.","BRAND":"NZXT"},{"PRON":"NZXT Source 530","GRAPH":"NZXTS530","COST":"120","MRSP":"119.99","QOH":"24","QOB":"0","ITEM":"The Phantom 530 has all the beloved features of the original Phantom chassis, with fully-modular hard drive cages, a discrete SSD mount behind the motherboard tray, NZXT's signature rear I/O LEDs, a single channel 30W fan controller with integrated 10-port fan hub, and steel 5.25in. optical drive latches. Now, Phantom 530 has more for you. It offers more cable management space up to 34mm (70% more than the original Phantom chassis), and supports more airflow and water cooling.","BRAND":"NZXT"},{"PRON":"Corsair 400C","GRAPH":"COR400C","COST":"130","MRSP":"129.99","QOH":"16","QOB":"2","ITEM":"We’ve engineered the Carbide Clear 400C to pack all the performance and expandability you need into a beautifully compact case design. Put your components on display through the gorgeous, full-size window panel that opens with a touch — and keep it all running cool and quiet with Direct Airflow technology.","BRAND":"Corsair"},{"PRON":"Corsair Carbide 100R","GRAPH":"CORC100R","COST":"65","MRSP":"64.99","QOH":"2","QOB":"4","ITEM":"A great foundation for your new powerhouse, the Corsair Carbide Series 100R computer case delivers all the features you need at the price you want. Its clean, modern exterior design with side panel window will make an impression at the first sight. And in the modern-looking, full black interior, you'll find ample room, and ergonomic, convenience design to simplify your building process, like tool-free 3.5" and 5.25" drive installation, cable routing channels and holes, and bottom-mount PSU design. Adequate number of fan mounts with one pre-install fan enables amazing cooling potential. Dual USB 3.0 ports on front panel make it easy to use your external HDD, HD webcam and other high speed peripherals.","BRAND":"Corsair"}]
